<?php

use yii\db\Migration;

/**
 * Class m190315_172855_categories
 */
class m190315_172855_categories extends Migration
{

    /**
     * {@inheritdoc}
     */

    public function safeUp()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_unicode_ci ENGINE=INNODB';
        }
        $this->createTable('{{%categories}}', [
            'id' => $this->primaryKey(),
            'cat_name' => $this->string(95)->unique()->notNull(),
            'cat_definition' => $this->string(95)->notNull(),

        ], $tableOptions);

        $this->batchInsert('{{%categories}}', ['cat_name', 'cat_definition'],
            [
                ['Ноутбуки та комп’ютери', 'НоутбукиПланшетВідеокартиЖорсткі диски та дискові масивиМоніториКомп\'ютери, неттопи, моноблокиПроцесориSSDМФП/ПринтериПам\'ять,
                Материнські платиМишіМаршрутизаториАкустичні системиКлавіатуриБлоки живленняКорпусиПроекториФлеш пам\'ять USB'],
                ['Смартфони, ТВ і електроніка', 'Мобільні телефониТелевізориФотоапаратиНавушникиУніверсальні мобільні батареїКарти пам\'ятіВідеокамериЕлектронні книги
                ВідеореєстраториПідставки, кріплення для ТВМузичні центри та магнітоли'],
                ['Побутова техніка', 'ХолодильникиПральні машиниКондиціонериМультиваркиПилососиБойлериМорозильні камериВбудовані духові шафиКонвекториВитяжкиПлитиПосудомийні машини'],
                ['Товари для дому', 'Офісні крісла та стільціМатрациПостільна білизнаЛампиЗасоби для пранняКомплекти відеоспостереженняДрабини, підмосткиСковородиКовдри
                ПодушкиКомплекти сигналізацій'],
                ['Інструменти та автотовари', 'АвтошиниГенераториЗварювальне обладнанняВідеореєстраториНабори інструментівАвтомастилаШурупокрути та електровикруткиБолгарки
                ПерфораториУніверсальні мийкиGPS-навігатори'],
                ['Дача, сад і город', 'Тримери та мотокосиЛанцюгові пилиНасоси та помпиГазонокосаркиОбприскувачіСнігоприбиральна техніка та інвентарКультиватори та мотоблоки
                ШлангиРучний садовий інструментСадовий інвентарКорми для собак'],
            ]);
    }


    public function safeDown()
    {
        // echo "m190213_184127_users cannot be reverted.\n";
        $this->dropTable('{{%categories}}');
        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m190315_172855_categories cannot be reverted.\n";

        return false;
    }
    */
}
